[
  {
    "id": "the-tipping-point",
    "title": "The Tipping Point",
    "description": "How Little Things Can Make a Big Difference",
    "author": "Malcolm Gladwell",
    "publishedYear": 2000,
    "category": "PSYCHOLOGY",
    "status": "COMPLETED",
    "isbn": null,
    "keyTakeaways": [],
    "quotes": [
      "These three characteristics – one, contagiousness; two, the fact that little causes can have big effects; and three, that change happens not gradually but at one dramatic moment.",
      "Epidemics are a function of the people who transmit infectious agents, the infectious agent itself, and the environment in which the infectious agent is operating. … These three agents of change I call the Law of the Few, the Stickiness Factor, and the Power of Context.",
      "The Stickiness Factor says… there are relatively simple changes in the presentation and structuring of information that can make a big difference in how much of an impact it makes.",
      "When people are in a group… responsibility for acting is diffused. They assume that someone else will make the call, or they assume that because no one else is acting, the apparent problem isn't really a problem.",
      "Proximity overpowered similarity.",
      "We are friends with the people we so things with, as much as we ate with the people we resemble. We don't seek out friends in other words. We associate with people who occupy the same small, physical spaces as we do.",
      "If you'd asked the head nodders why they wanted tuition to increase so dramatically … none of them would say \"because I was nodding my head while I listend to that editorial\". They'd probably say it was because they found the editorial insightful or intelligent. They would attribute their attitude to some obvious logical cause.",
      "We normally think of the expression on our face as a reflection of an inner state. I feel happy, so I smile. I feel sad, so I frown. Emotion goes inside out. Emotional contagion though, suggests that the opposite is also true. If I can make you smile, I can make you happy, if I can make you frown, I can make you sad. Emotion, this sense, goes outside-in.",
      "James O. Wilson & George Kelling argued that crime is the inevitable result of disorder. If a broken window is left unrepaired, people walking by will conclude that no one cares and no one is in charge. Soon, more windows will be broken, and the sense of anarchy will spread.",
      "When we talk about memory, we aren't just talking about ideas and impressions and facts stored inside our heads. An awful lot of what we remember is actually stored outside our brains. Most of us deliberately don't memorize most phone numbers we need. But we memorize where to find them.",
      "The theory of Tipping Point requires, however, that we reframe the way we think about the world… We have trouble estimating dramatic, exponential change. We cannot convince that a piece of paper folded over 50 times can reach the sun. There are abrupt limits to the number of cognitive categories we can make and number of people we can truly love and number of acquaintances we can truly know. We trow up our hands at a problem phrased in an abstract way, but have no difficulty at solving the same problem rephrased as a social dilemma. All of these things are expressions of the peculiarities of the human mind and heart, a refutation of the notion that the way we function and communicate and process information is straightforward and transparent. It is not. It is messy and opaque.",
      "… the fundamental attribution error, which is a fancy way of saying that when ot comes to interpreting other peoples behaviour, human beings invariably make the mistake of overestimating the importance of fundamental character traits and underestimating the importance of the situation and context."
    ],
    "tags": ["done", "with notes"],
    "skillIds": ["ux-user-experience-design", "user-research"],
    "caseStudyIds": [
      "improving-marketplace-checkout-experience",
      "effortless-onboarding-with-a-personalised-reward",
      "a-filter-for-every-yogi",
      "custom-lists-for-self-organisation"
    ],
    "toolIds": [],
    "achievementIds": [],
    "hasNotes": true,
    "thoughts": "8/10 - Easy read, real interesting case studies, applicable to personal and professional life.",
    "relatedBookIds": [
      "predictably-irrational",
      "thinking-fast-and-slow",
      "influence"
    ]
  },
  {
    "id": "flow",
    "title": "Flow",
    "description": "The Psychology of Optimal Experience",
    "author": "Mihaly Csikszentmihalyi",
    "publishedYear": 1990,
    "category": "PSYCHOLOGY",
    "status": "COMPLETED",
    "isbn": null,
    "keyTakeaways": [],
    "quotes": [
      "We can not reach happiness by consciously searching for it. 'Ask yourself whether you are happy' said J.S.Mill ' and you cease to be so'.",
      "The optimal state of inner experience is one, in which there is order in consciousness. This happens when physic energy - or attention - is invested in realistic goals, and when skill matches the opportunities for action. The pursuit of a realistic goal brings order and awareness because a person must concentrate attention on the task at hand and momentarily forget everything.",
      "While human kind collectively has increased its material power by a thousand fold, it has not advanced very far in terms of improving the concept of experience.",
      "Intentions arise in consciousness whenever a person is aware of desiring or wanting to accomplish something. ... We often call the manifestation of intentionality by other names such as instinct, need, drive or desire.",
      "Pleasure is a feeling of contentment that one achieves whenever information in consciousness says that expectations set by biological programs or social condition have been met.",
      "Enjoyable everts occur when a person has not only met some prior expectations or satisfied a need or a desire but also gone beyond what he or she has been programmed to do and achieved something unexpected, perhaps something even unimagined before.",
      "Enjoyment appears at the boundary between boredom and anxiety, when the challenges are just balanced with the persons capacity to act.",
      "It is not possible to experience a feeling of control unless one is willing to give up the safety of protective routines.",
      "The obvious critique... is that science... deals with what is. not with what ought to be. Faith and beliefs, on the other hand, are not limited by actuality; they deal with what is right, what is desirable."
    ],
    "tags": ["done", "with notes"],
    "skillIds": ["ux-user-experience-design", "user-research"],
    "caseStudyIds": ["improving-marketplace-checkout-experience"],
    "toolIds": [],
    "achievementIds": [],
    "hasNotes": true,
    "thoughts": "7/10 - The middle part is a bit drawn out but the triggerd reflection and application on ones personal life I find quite valuable.",
    "relatedBookIds": ["predictably-irrational", "thinking-fast-and-slow"]
  },
  {
    "id": "thinking-fast-and-slow",
    "title": "Thinking Fast and Slow",
    "description": "How Your Brain Makes Decisions",
    "author": "Daniel Kahneman",
    "publishedYear": 2011,
    "category": "PSYCHOLOGY",
    "status": "COMPLETED",
    "isbn": null,
    "keyTakeaways": [],
    "quotes": [
      "System one is often able to produce quick answers to difficult questions by substitution. Creating coherence where there is none. The question that is answered is not the one that was intended, but the answer is produced quickly and may be sufficiently plausible to pass the lacks and lenient review of system two.",
      "On the way to near perfection some mistakes are made with grate confidence.",
      "In choices, based on description, rare outcomes are overrated relative to their probability. In sharp contrast, overrating is never observed in choices based on experience, and underrating is common. The probability of a rare event will often, not always, be overrated because of the confirmatory bias of memory. Thinking about that event, you try to make it true in your mind. A rare event will be overweighted if its specifically attracts attention. Separate attention is effectively guaranteed when prospect are described explicitly.",
      "Changing one's mind about human nature is hard work, and changing one's mind for the worse about oneself is even harder.",
      "Subjects unwillingness to deduce the particular from the general was matched only by their willingness to infer the general from the particular.",
      "We can be blind to the obvious. And we are also blind to our blindness.",
      "Anything that occupies your working memory, reduces your ability to think.",
      "A general 'law of least effort' applies to cognitive as well as physical exertion. The law asserts that if there area several ways of achieving the same goal, people will eventually gravitate to the least demanding course of action.",
      "Intelligence is not only the ability to reason; it is also the ability to find relevant material in memory and to deploy attention when needed. Memory function is an attribute of System 1. However, everyone has the option of slowing down to conduct an active search of memory for all relevant facts."
    ],
    "tags": ["done", "with notes"],
    "skillIds": ["ux-writing", "ux-user-experience-design", "user-research"],
    "caseStudyIds": ["improving-marketplace-checkout-experience"],
    "toolIds": [],
    "achievementIds": [],
    "hasNotes": true,
    "thoughts": "9/10 - A personal accomplishment but not a book for everyone. Powerful fundamentals but you gotta put in work to learn how to apply them best.",
    "relatedBookIds": [
      "predictably-irrational",
      "influence",
      "the-tipping-point",
      "flow"
    ]
  },
  {
    "id": "predictably-irrational",
    "title": "Predictably Irrational",
    "description": "The Hidden Forces That Shape Our Decisions",
    "author": "Dan Ariely",
    "publishedYear": 2008,
    "category": "PSYCHOLOGY",
    "status": "COMPLETED",
    "isbn": null,
    "keyTakeaways": [],
    "quotes": [
      "Ownership is not limited to material things. It can also apply to points of view. Once we take ownership of an idea — whether it's about politics or sports — what do we do? We love it perhaps more than we should. We prize it more than it is worth. And most frequently, we have trouble letting go of it because we can't stand the idea of its loss. What are we left with then? An ideology — rigid and unyielding.",
      "What is it about 'free' that's so enticing? Why do we have an irrational urge to jump for a 'free' item, even when it's not what we really want? I believe the answer is this. Most transactions have an upside and a downside, but when something is 'free' we forget the downside, 'free' gives us such an emotional charge that we perceive what is being offered as immensely more valuable than it really is. Why? I think it's because humans are intrinsically afraid of loss. The real allure of 'free' is tied to this fear. There's no visible possibility of loss when we choose a 'free' item (it's free). But suppose we choose the item that's not free. Uh-oh, now there's a risk of having made a poor decision—the possibility of a loss. And so, given the choice, we go for what is free.",
      "We usually think of ourselves as sitting the driver's seat, with ultimate control over the decisions we made and the direction our life takes; but, alas, this perception has more to do with our desires-with how we want to view ourselves-than with reality.",
      "Money, as it turns out, is very often the most expensive way to motivate people. Social norms are not only cheaper, but often more effective as well.",
      "Most people don't know what they want unless they see it in context.",
      "There are many examples to show that people will work more for a cause than for cash.",
      "A few years ago, for instance, the AARP asked some lawyers if they would offer less expensive services to needy retirees, at something like $30 an hour. The lawyers said no. Then the program manager from AARP had a brilliant idea: he asked the lawyers if they would offer free services to needy retirees. Overwhelmingly, the lawyers said yes. What was going on here? How could zero dollars be more attractive than $30? When money was mentioned, the lawyers used market norms and found the offer lacking, relative to their market salary. When no money was mentioned they used social norms and were willing to volunteer their time. Why didn't they just accept the $30, thinking of themselves as volunteers who received $30? Because once market norms enter our considerations, the social norms depart.",
      "People are sometimes willing to sacrifice the pleasure they get from a particular consumption experience in order to project a certain image to others."
    ],
    "tags": ["done", "with notes"],
    "skillIds": ["ux-user-experience-design", "user-research", "ux-writing"],
    "caseStudyIds": [
      "improving-marketplace-checkout-experience",
      "effortless-onboarding-with-a-personalised-reward",
      "easy-ordering-for-every-diet"
    ],
    "toolIds": [],
    "achievementIds": [],
    "hasNotes": true,
    "thoughts": "10/10 - Very inspiring and interesting. Stuff makes ya think man.",
    "relatedBookIds": [
      "thinking-fast-and-slow",
      "influence",
      "the-tipping-point",
      "flow"
    ]
  },
  {
    "id": "influence",
    "title": "Influence",
    "description": "The Psychology of Persuasion",
    "author": "Robert Cialdini",
    "publishedYear": 1984,
    "category": "PSYCHOLOGY",
    "status": "COMPLETED",
    "isbn": null,
    "keyTakeaways": [],
    "quotes": [
      "Click, Run",
      "The future reach of the obligation in nicely connoted in a Japanese word for thank you, sumimasen, which, in its literal form, means 'this will not end'",
      "A widely shared and strongly held feeling of future obligation made an enormous difference in human social evolution because it meant that a person could give something to another with confidence that the gift was not being lost.",
      "So informed, I remained awed but no longer puzzled.",
      "… one study showed that mailing a $5 'gift' check along with an insurance survey was twice as effective as offering a $50 payment for sending back a completed survey.",
      "It is useless to attempt to reason a man out of a thing he was never reasoned into.",
      "To change feelings, counteract them with other feelings.",
      "People are even more likely to purchase a product if its brand name shares initial letters with their own name.",
      "…compliment not just on the behaviour but, instead on a trait. You'll probably see more of it.",
      "The greater the number of people who find any idea correct, the more a given individual will perceive the idea to be correct.",
      "…there are 3 optimising conditions: when we are unsure of what is best to do (uncertainty); when the evidence of what is best to do comes from numerous others (the many); and when that evidence comes from people like us (similarity).",
      "If one person says you have a tail you laugh it off as stupid; but, if three people say if, you turn around.",
      "…they don't recognise that within the lament 'Look at all the people who are doing this undesirable thing' lurks the undercutting message 'Look at all the people who are doing it'",
      "The simultaneous blessing and curse of such blind obedience is its mechanical character. We don't have to think, therefore we don't.",
      "…a communicator who references a weakness early on is seen as more honest.",
      "If one has enough to survive, an increase in resources will be helpful but a decrease in those same resources could be fatal. Consequently, it would be adaptive to be especially sensitive to the possibility of loss.",
      "We know that things that are difficult to get are typically better than those that are easy to get. As such, we can often use an item's limited availability to help us quickly and correctly decide on its higher quality, which we don't want to lose. Thus, one reason for the potency of the scarcity principle is, by following it, we are usually and efficiently right.",
      "In addition, there is a unique, secondary source of power within the scarcity principle: as opportunities become less available, we lose freedoms. And we hate to lose the freedoms we already have…When something becomes less available, our freedom to have it is limited, and we experience an increased desire for it. We rarely recognize, however, that psychological reactance has caused us to want the item more; all we know is we want it. To make sense of our heightened desire for the item, we begin to assign it positive qualities.",
      "Once we make a choice or take a stand, we encounter personal and interpersonal pressures to think and behave consistently with that commitment. Moreover, those pressures will cause us to respond in ways that justify our decision.",
      "…consistency offers a shortcut through the complexities of modern life. Once we have made up our minds about an issue, stubborn consistency allows us an appealing luxury: we don't have to think hard about the issue anymore.",
      "People are inclined to say yes to someone they consider one of them.",
      "One possibility is to use language and imagery to bring the concept of kin to our consciousness. For Example, collectives that create a sense of 'we'-ness among their members are characterised by the use of familial images and labels – such as 'brothers', 'sisterhood', 'forefathers', 'motherland', 'ancestry', 'legacy', 'heritage' and the like – with lead to an increased willingness to sacrifice one's won interests for the welfare of the group.",
      "Providing advice puts a person in a merging state of mind, which stimulates a linking of one's own identity with another party's. Providing an opinion or expectation, on the other hand, puts a person in an introspective state of mind, which involves focusing on oneself.",
      "But notice something telling: our modern era, often termed the Information Age, has never been called the Knowledge Age. Information does not translate directly into knowledge. It must first be processed-accessed, absorbed, comprehended, integrated, and retained."
    ],
    "tags": ["done", "with notes"],
    "skillIds": ["ux-writing", "user-research", "ux-user-experience-design"],
    "caseStudyIds": ["improving-marketplace-checkout-experience"],
    "toolIds": [],
    "achievementIds": [],
    "hasNotes": true,
    "thoughts": "100/10 - A chonker full of valuable insights and case studies. Easy to read, it just takes a while.",
    "relatedBookIds": [
      "predictably-irrational",
      "thinking-fast-and-slow",
      "the-tipping-point"
    ]
  },
  {
    "id": "design-sprint",
    "title": "Design Sprint",
    "description": "A practical guide to solving big problems and testing new ideas in just five days.",
    "author": "Jake Knapp",
    "publishedYear": 2016,
    "category": "DESIGN_THINKING",
    "status": "COMPLETED",
    "isbn": null,
    "keyTakeaways": [],
    "quotes": [
      "By asking people for their input early in the process, you help them feel invested in the outcome.",
      "We've found that magic happens when we use big whiteboards to solve problems. As humans, our short-term memory is not all that good, but our spatial memory is awesome. A sprint room, plastered with notes, diagrams, printouts, and more, takes advantage of that spatial memory. The room itself becomes a sort of shared brain for the team.",
      "Lurking beneath every goal are dangerous assumptions. The longer those assumptions remain unexamined, the greater the risk.",
      "It's what work should be about—not wasting time in endless meetings, then seeking camaraderie in a team-building event at a bowling alley—but working together to build something that matters to real people. This is the best use of your time. This is a sprint.",
      "If you're the Facilitator, using the Time Timer comes with two extra benefits. First, it makes you look like you know what you're doing. After all, you've got a crazy clock! Second, although most would never admit it, people like having a tight schedule. It builds confidence in the sprint process, and in you as a Facilitator.",
      "When all you have is statistics, you have to guess what your customers are thinking. When you're doing an interview, you can just . . . ask."
    ],
    "tags": ["done", "with notes"],
    "skillIds": [
      "ux-user-experience-design",
      "user-research",
      "workshop-facilitation"
    ],
    "caseStudyIds": [
      "improving-marketplace-checkout-experience",
      "a-filter-for-every-yogi",
      "custom-lists-for-self-organisation",
      "easy-ordering-for-every-diet"
    ],
    "toolIds": [],
    "achievementIds": [],
    "hasNotes": true,
    "thoughts": "8/10 - Quick read and inspiring. Maybe a tad idealistic but the methods are great and can be used on their own or when remixing the process."
  },
  {
    "id": "how-to-win-friends",
    "title": "How to Win Friends & Influence People",
    "description": "The Classic Guide to Success",
    "author": "Dale Carnegie",
    "publishedYear": 1936,
    "category": "LEADERSHIP",
    "status": "COMPLETED",
    "isbn": null,
    "keyTakeaways": [],
    "quotes": [
      "Any fool can criticize, complain, and condemn—and most fools do. But it takes character and self-control to be understanding and forgiving.",
      "Instead of condemning people, let's try to understand them. Let's try to figure out why they do what they do. That's a lot more profitable and intriguing than criticism; and it breeds sympathy, tolerance and kindness.",
      "Everybody in the world is seeking happiness—and there is one sure way to find it. That is by controlling your thoughts. Happiness doesn't depend on outward conditions. It depends on inner conditions.",
      "A man convinced against his will is of the same opinion still.",
      "Personally I am very fond of strawberries and cream, but I have found that for some strange reason, fish prefer worms. So when I went fishing, I didn't think about what I wanted. I thought about what they wanted. I didn't bait the hook with strawberries and cream. Rather, I dangled a worm or grasshopper in front of the fish and said: 'Wouldn't you like to have that?'",
      "If you want to gather honey, don't kick over the beehive.",
      "Only knowledge that is used sticks in your mind.",
      "By becoming interested in the cause, we are less likely to dislike the effect.",
      "Every man I meet is my superior in some way. In that, I learn of him.",
      "There's magic, positive magic, in such phrases as: 'I may be wrong. I frequently am. Let's examine the facts.'"
    ],
    "tags": ["done", "with notes"],
    "skillIds": [
      "workshop-facilitation",
      "ux-user-experience-design",
      "ux-writing"
    ],
    "caseStudyIds": ["improving-marketplace-checkout-experience"],
    "toolIds": [],
    "achievementIds": [],
    "hasNotes": true,
    "thoughts": "6/10 - Interesting tactics if you remember to apply them and chose the right moments ethically."
  },
  {
    "id": "actionable-gamification",
    "title": "Actionable Gamification",
    "description": "Beyond Points, Badges, and Leaderboards",
    "author": "Yu-Kai Chou",
    "publishedYear": 2015,
    "category": "DESIGN_THINKING",
    "status": "COMPLETED",
    "isbn": null,
    "keyTakeaways": [],
    "quotes": [
      "Extrinsic Motivation focuses on results, while Intrinsic Motivation focuses on the process.",
      "The truth is, simply incorporating game mechanics and game elements does not make a game fun.",
      "If there is only one thing you remember after reading this book, it should be to focus on motivation by thinking through the 8 Core Drives instead of focusing on features and functionalities.",
      "Effective gamification is a combination of game design, game dynamics, behavioral economics, motivational psychology, UX/UI (User Experience and User Interface), neurobiology, technology platforms, as well as ROI-driving business implementations.",
      "The reason you are using a product on Day 1 is often very different from that of Day 100. In a bureaucratic organization, though everyone likes to talk about innovation, innovation requires risk, and the corporate ladder trains people to be risk averse. If anything new is happening, it is only after authorization through many signatures - to the point where no one could claim full responsibility if things went wrong. Managers often push everyone to come up with innovative ideas, but when they actually hear something new, they immediately respond with, 'Hmm, has any other company done that before?'",
      "People do not take actions that are necessarily the most economical, but actions that make them feel the smartest.",
      "This is incredibly frustrating for those who have creative ideas which may positively impact the status quo, especially when their ideas are immediately shot down or the approval process is dragged out indefinitely. It is a sad scenario - as companies grow larger and more bureaucratic, they become less agile, less adaptive to changing business conditions. As a result, younger and more nimble companies adapt to changing business models more swiftly than their cumbersome counterparts and quickly take advantage of new opportunities. All too often many great companies from the past century eventually fall into extinction."
    ],
    "tags": ["done", "with notes"],
    "skillIds": ["ux-user-experience-design", "ux-writing", "user-research"],
    "caseStudyIds": ["improving-marketplace-checkout-experience"],
    "toolIds": [],
    "achievementIds": [],
    "hasNotes": true,
    "thoughts": "10/10 - Very actionable and covers a lot of ground which makes it valuable for most projects and situations."
  },
  {
    "id": "theory-of-fun",
    "title": "The Theory of Fun",
    "description": "For Game Design",
    "author": "Raph Koster",
    "publishedYear": 2004,
    "category": "DESIGN_THINKING",
    "status": "COMPLETED",
    "isbn": null,
    "keyTakeaways": [],
    "quotes": [
      "Real fun comes from challenges that are always at the margin of our abilities.",
      "That's what games are for in the first place - to package up the unpredictable and the learning experience into a space and time where there is no risk.",
      "...the human brain is mostly a voracious consumer of patterns, a soft pudgy gray Pac-Man of concepts. Games are just exceptionally tasty patterns to eat up.",
      "Thinking is, in fact, mostly memory, pattern-matching against past experiences.",
      "Music is ordered sound and silence... Noise is any pattern we don't understand.",
      "The very phrase 'it's just a game' implies that playing a game is a form of PRACTICE for real-life challenges."
    ],
    "tags": ["done", "with notes"],
    "skillIds": ["user-research", "ux-user-experience-design", "ux-writing"],
    "caseStudyIds": [
      "improving-marketplace-checkout-experience",
      "oouxing-my-portfolio"
    ],
    "toolIds": [],
    "achievementIds": [],
    "hasNotes": true,
    "thoughts": "10/10 - Short but packed with very good points about what fun is and why learning rocks."
  },
  {
    "id": "paradox-of-choice",
    "title": "The Paradox of Choice",
    "description": "Why More Is Less",
    "author": "Barry Schwartz",
    "publishedYear": 2004,
    "category": "PSYCHOLOGY",
    "status": "COMPLETED",
    "isbn": null,
    "keyTakeaways": [],
    "quotes": [
      "But knowing what we want means, in essence, being able to anticipate accurately how one choice or another will make us feel, and that is no simple task.",
      "So it seems that neither our predictions about how we will feel after an experience nor our memories of how we did feel during the experience are very accurate reflections of how we actually do feel while the experience is occurring. And yet it is memories of the past and expectations for the future that govern our choices.",
      "When asked about what they regret most in the last six months, people tend to identify actions that didn't meet expectations. But when asked about what they regret most when they look back on their lives as a whole, people tend to identify failures to act.",
      "Freedom to choose has what might be called expressive value. Choice is what enables us to tell the world who we are and what we care about.",
      "Pay attention to what you're giving up in the next-best alternative, but don't waste energy feeling bad about having passed up an option further down the list that you wouldn't have gotten to anyway.",
      "I believe that one of the reasons that maximizers are less happy, less satisfied with their lives, and more depressed than satisficers is precisely because the taint of trade-offs and opportunity costs washes out much that should be satisfying about the decisions they make.",
      "So by using rules, presumptions, standards, and routines to constrain ourselves and limit the decisions we face, we can make life more manageable, which gives us more time to devote ourselves to other people and to the decisions that we can't or don't want to avoid.",
      "I think that in modern America, we have far too many options for breakfast cereal and not enough options for president."
    ],
    "tags": ["done", "with notes"],
    "skillIds": ["ux-writing", "ux-user-experience-design", "user-research"],
    "caseStudyIds": [
      "improving-marketplace-checkout-experience",
      "effortless-onboarding-with-a-personalised-reward"
    ],
    "toolIds": [],
    "achievementIds": [],
    "hasNotes": true,
    "thoughts": "9/10 Very interesting, inspiring and entertaining"
  },
  {
    "id": "design-of-everyday-things",
    "title": "The Design of Everyday Things",
    "description": "Valuable fundamentals every designer should learn about.",
    "author": "Don Norman",
    "publishedYear": 2013,
    "category": "DESIGN_THINKING",
    "status": "COMPLETED",
    "isbn": null,
    "keyTakeaways": [],
    "quotes": [
      "One way of overcoming the fear of the new is to make it look like the old.",
      "Affordances define what actions are possible. Signifiers specify how people discover those possibilities: signifiers are signs, perceptible signals of what can be done. Signifiers are of far more importance to designers than are affordances.",
      "Good design is actually a lot harder to notice than poor design, in part because good designs fit our needs so well that the design is invisible, serving us without drawing attention to itself. Bad design, on the other hand, screams out its inadequacies, making itself very noticeable.",
      "The problem with the designs of most engineers is that they are too logical. We have to accept human behavior the way it is, not the way we would wish it to be.",
      "Two of the most important characteristics of good design are discoverability and understanding.",
      "In the university, professors make up artificial problems. In the real world, the problems do not come in nice, neat packages. They have to be discovered.",
      "If the system lets you make the error, it is badly designed.",
      "Don't criticize unless you can do better. Try to understand how the faulty design might have occurred: try to determine how it could have been done otherwise.",
      "Thus, novices are more likely to make mistakes than slips, whereas experts are more likely to make slips. Mistakes often arise from ambiguous or unclear information about the current state of a system, the lack of a good conceptual model, and inappropriate procedures. Recall that most mistakes result from erroneous choice of goal or plan or erroneous evaluation and interpretation. All of these come about through poor information provided by the system about the choice of goals and the means to accomplish them (plans), and poor-quality feedback about what has actually happened."
    ],
    "tags": ["done", "with notes"],
    "skillIds": [
      "ux-user-experience-design",
      "ux-writing",
      "ui-user-interface-design"
    ],
    "caseStudyIds": [
      "improving-marketplace-checkout-experience",
      "effortless-onboarding-with-a-personalised-reward",
      "a-filter-for-every-yogi",
      "custom-lists-for-self-organisation"
    ],
    "toolIds": [],
    "achievementIds": [],
    "hasNotes": true,
    "thoughts": "10/10 - Valuable fundamentals every designer should learn about."
  },
  {
    "id": "incognito",
    "title": "Incognito",
    "description": "The Secret Lives of the Brain",
    "author": "David Eagleman",
    "publishedYear": 2011,
    "category": "PSYCHOLOGY",
    "status": "COMPLETED",
    "isbn": null,
    "keyTakeaways": [],
    "quotes": [
      "The difference between being awake and being asleep is merely that the data coming in from the eyes anchors the perception. Asleep vision (dreaming) is perception that is not tied down to anything in the real world; waking perception is something like dreaming with a little more commitment to what´s in front of you.",
      "You´re not perceiving what's out there. You're perceiving whatever your brain tells you.",
      "There is a looming chasm between what your brain knows and what your mind is capable of accessing.",
      "So the first lesson about trusting your senses is: don't. Just because you believe something to be true, just because you know it's true, that doesn't mean it is true.",
      "When the brain activity is kindled in the right spot, people hear voices. If a physician prescribes an anti-epileptic medication, the seizures go away and the voices disappear. Our reality depends on what our biology is up to.",
      "The conscious mind is not at the center of the action in the brain; instead, it is far out on a distant edge, hearing but whispers of the activity.",
      "Knowing yourself now requires the understanding that the conscious you occupies only a small room in the mansion of the brain, and that it has little control over the reality constructed for you.",
      "Many people prefer a view of human nature that includes a true side and a false side—in other words, humans have a single genuine aim and the rest is decoration, evasion, or cover-up. That's intuitive, but it's incomplete. A study of the brain necessitates a more nuanced view of human nature.",
      "Our internal life and external actions are steered by biological coctails to which we have neither immediate access nor direct acquaintance."
    ],
    "tags": ["done", "with notes"],
    "skillIds": ["ux-writing", "ux-user-experience-design", "user-research"],
    "caseStudyIds": [],
    "toolIds": [],
    "achievementIds": [],
    "hasNotes": true,
    "thoughts": "7/10 Not the most useful to UX but loads of examples about how our brain works that are very interesting to read about and somehow calming"
  },
  {
    "id": "continuous-discovery-habits",
    "title": "Continuous Discovery Habits",
    "description": "Discover Products that Create Customer Value and Business Value",
    "author": "Teresa Torres",
    "publishedYear": 2021,
    "category": "DESIGN_THINKING",
    "status": "COMPLETED",
    "isbn": null,
    "keyTakeaways": [],
    "quotes": [
      "Assigning product outcomes to product trios increases a sense of responsibility and ownership. If a product team is assigned a business outcome, it's easy for the trio to blame the marketing or customer-support team for not hitting their goal. However, if they are assigned a product outcome, they alone are responsible for driving results. When multiple teams are assigned the same outcome, it's easy to shift blame for lack of progress.",
      "asked a woman what factors she considered when buying a new pair of jeans. She didn't hesitate to answer. She said, 'Fit is my number-one factor.' I then asked her to tell me about the last time she bought a pair of jeans. She said, 'I bought them on Amazon.' I asked, 'How did you know they would fit?' She replied, 'I didn't, but they were a brand I liked, and they were on sale.'",
      "Good tests kill flawed theories; we remain alive to guess again.",
      "When we learn through testing that an idea won't work, it's not enough to move on to the next idea. We need to take time to reflect. We want to ask: 'Based on my current understanding of my customer, I thought this solution would work. It didn't. What did I misunderstand about my customer?' We then need to revise our understanding of the opportunity space before moving on to new solutions.",
      "The key to bringing stakeholders along is to show your work. You want to summarize what you are learning in a way that is easy to understand, that highlights your key decision points and the options that you considered, and creates space for them to give constructive feedback.",
      "He describes a Level 1 decision as one that is hard to reverse, whereas a Level 2 decision is one that is easy to reverse. Bezos argues that we should be slow and cautious when making Level 1 decisions, but that we should move fast and not wait for perfect data when making Level 2 decisions.",
      "Groupthink occurs when a group of individuals underperform due to the dynamics of the group. There are a number of reasons for this. When working in a group, it's common for some members to put in more effort than others; some group members may hesitate or even refrain from speaking up, and groups tend to perform at the level of the least-capable member. In order to leverage the knowledge and expertise in our trios, we need to actively work to counter groupthink."
    ],
    "tags": ["done", "with notes"],
    "skillIds": [
      "user-research",
      "ux-user-experience-design",
      "workshop-facilitation"
    ],
    "caseStudyIds": [
      "improving-marketplace-checkout-experience",
      "a-filter-for-every-yogi",
      "custom-lists-for-self-organisation"
    ],
    "toolIds": [],
    "achievementIds": [],
    "hasNotes": true,
    "thoughts": "10/10 - Very realistic, helpful and actionable examples about how to do product development in a structured, experiment based way while keeping the user is the center"
  },
  {
    "id": "jobs-to-be-done",
    "title": "Jobs to Be Done",
    "description": "A Roadmap for Customer-Centered Innovation",
    "author": "Stephen Wunker, Jessica Wattman & David Farber",
    "publishedYear": 2016,
    "category": "DESIGN_THINKING",
    "status": "COMPLETED",
    "isbn": null,
    "keyTakeaways": [],
    "quotes": [],
    "tags": ["done"],
    "skillIds": ["user-research", "ux-user-experience-design"],
    "caseStudyIds": [
      "improving-marketplace-checkout-experience",
      "a-filter-for-every-yogi",
      "custom-lists-for-self-organisation",
      "easy-ordering-for-every-diet"
    ],
    "toolIds": [],
    "achievementIds": [],
    "hasNotes": false,
    "thoughts": "5/10 - Nice to read a bit more about the theory but the TED talk already said it all."
  },
  {
    "id": "inspired",
    "title": "Inspired",
    "description": "How to Create Products Customers Love",
    "author": "Marty Cagan",
    "publishedYear": 2008,
    "category": "DESIGN_THINKING",
    "status": "DNF",
    "isbn": null,
    "keyTakeaways": [],
    "quotes": [],
    "tags": [],
    "skillIds": ["ux-user-experience-design", "workshop-facilitation"],
    "caseStudyIds": [],
    "toolIds": [],
    "achievementIds": [],
    "hasNotes": false,
    "thoughts": "Not a bad book (easy and inspiring read) but at this point I feel like I already heard most of what this book is talking about."
  },
  {
    "id": "choice-hacking",
    "title": "Choice Hacking",
    "description": "How to Use Psychology and Behavioral Science to Create an Experience That Sings",
    "author": "Jennifer Clinehens",
    "publishedYear": 2020,
    "category": "DESIGN_THINKING",
    "status": "COMPLETED",
    "isbn": null,
    "keyTakeaways": [],
    "quotes": [],
    "tags": ["done"],
    "skillIds": ["ux-writing", "user-research", "ux-user-experience-design"],
    "caseStudyIds": [
      "improving-marketplace-checkout-experience",
      "effortless-onboarding-with-a-personalised-reward",
      "easy-ordering-for-every-diet"
    ],
    "toolIds": [],
    "achievementIds": [],
    "hasNotes": false,
    "thoughts": "7/10 - Pop-Science like. Not that deep but enjoyable, easy read and a good entry point for behavioural psychology."
  },
  {
    "id": "ux-for-lean-startups",
    "title": "UX for Lean Startups",
    "description": "Faster, Smarter User Experience Research and Design",
    "author": "Laura Klein",
    "publishedYear": 2013,
    "category": "DESIGN_THINKING",
    "status": "COMPLETED",
    "isbn": null,
    "keyTakeaways": [],
    "quotes": [
      "Here is the worst possible way for you to try to figure out if your idea solves somebody's problem: Ask them. The vast majority of entrepreneurs seem to think that explaining their concept in detail to a few people and then asking whether it's a good idea constitutes validation. It does not.",
      "Trying new things constantly and then abandoning them without further study or work is not iterating. That's flailing.",
      "Premature prettification is the cause of more UX disasters than Myspace. There, I said it.",
      "The vast majority of interactions don't require anything visionary or groundbreaking or amazing. They require something usable and simple and clear.",
      "Design is not art. If you think that there's some ideal design that is completely divorced from the effect it's having on your company's bottom line, then you're an artist, not a designer. Design has a purpose and a goal, and those things can be measured.",
      "You'll know that you've validated a problem when you start to hear particular groups of people complaining about something specific.",
      "If you don't have time to do user research, you'd better make time to fix your product once you've built it wrong, because I guarantee that is what's going to happen. The fact is, you don't have time not to do research."
    ],
    "tags": ["done", "with notes"],
    "skillIds": [
      "ux-user-experience-design",
      "user-research",
      "workshop-facilitation"
    ],
    "caseStudyIds": [
      "improving-marketplace-checkout-experience",
      "effortless-onboarding-with-a-personalised-reward",
      "a-filter-for-every-yogi",
      "easy-ordering-for-every-diet"
    ],
    "toolIds": [],
    "achievementIds": [],
    "hasNotes": true,
    "thoughts": "7/10 - Super easy read with something for everyone. Not too deep, as its mostly case studies and short but good for an inspiration burst."
  },
  {
    "id": "ux-magic",
    "title": "UX Magic",
    "description": "The Art of Creating Delightful User Experiences",
    "author": "Daniel Rosenberg",
    "publishedYear": 2018,
    "category": "DESIGN_THINKING",
    "status": "DNF",
    "isbn": null,
    "keyTakeaways": [],
    "quotes": [],
    "tags": [],
    "skillIds": [
      "ux-user-experience-design",
      "ui-user-interface-design",
      "ooux-object-oriented-user-experience"
    ],
    "caseStudyIds": [],
    "toolIds": [],
    "achievementIds": [],
    "hasNotes": false,
    "thoughts": "In theory very interesting but the writing style was too negative for me."
  },
  {
    "id": "service-design-thinking",
    "title": "This is Service Design Thinking.",
    "description": "Basics - Tools - Cases",
    "author": "Marc Stickdorn",
    "publishedYear": 2011,
    "category": "DESIGN_THINKING",
    "status": "REFERENCE",
    "isbn": null,
    "keyTakeaways": [],
    "quotes": [],
    "tags": ["none"],
    "skillIds": [
      "ux-user-experience-design",
      "user-research",
      "workshop-facilitation"
    ],
    "caseStudyIds": ["improving-marketplace-checkout-experience"],
    "toolIds": [],
    "achievementIds": [],
    "hasNotes": false,
    "thoughts": "7/10 I think the first half could have been more condensed but it's a grate way of thinking with good methods to reference"
  },
  {
    "id": "universal-methods",
    "title": "Universal Methods of Design",
    "description": "100 Ways to Research Complex Problems, Develop Innovative Ideas, and Design Effective Solutions",
    "author": "Bella Martin & Bruce Hanington",
    "publishedYear": 2012,
    "category": "DESIGN_THINKING",
    "status": "REFERENCE",
    "isbn": null,
    "keyTakeaways": [],
    "quotes": [],
    "tags": ["none"],
    "skillIds": [
      "ux-user-experience-design",
      "user-research",
      "workshop-facilitation"
    ],
    "caseStudyIds": [
      "improving-marketplace-checkout-experience",
      "effortless-onboarding-with-a-personalised-reward",
      "a-filter-for-every-yogi",
      "custom-lists-for-self-organisation"
    ],
    "toolIds": [],
    "achievementIds": [],
    "hasNotes": false,
    "thoughts": "10/10 Really good to have on hand to know how to do a method but also to inspire which methods could be helpful in a given situation"
  },
  {
    "id": "ooux-podcast",
    "title": "OOUX Podcast",
    "description": "Object-Oriented UX Design",
    "author": "Sophia Prater",
    "publishedYear": 2020,
    "category": "DESIGN_THINKING",
    "status": "CURRENTLY_READING",
    "isbn": null,
    "keyTakeaways": [],
    "quotes": [],
    "tags": ["always up to date"],
    "skillIds": [
      "ux-user-experience-design",
      "ooux-object-oriented-user-experience"
    ],
    "caseStudyIds": [
      "improving-marketplace-checkout-experience",
      "a-filter-for-every-yogi",
      "custom-lists-for-self-organisation",
      "oouxing-my-portfolio"
    ],
    "toolIds": [],
    "achievementIds": [],
    "hasNotes": false,
    "thoughts": "10/10 - Recommending it all the time. Its educational every time and makes me want to go to the gym."
  },
  {
    "id": "growth-design-newsletter",
    "title": "Growth.Design Newsletter",
    "description": "The only newsletter I always read immediately.",
    "author": "Dan Benoni & Louis-Xavier Lavallee",
    "publishedYear": 2020,
    "category": "DESIGN_THINKING",
    "status": "CURRENTLY_READING",
    "isbn": null,
    "keyTakeaways": [],
    "quotes": [],
    "tags": ["always up to date"],
    "skillIds": [
      "ux-user-experience-design",
      "ux-writing",
      "ui-user-interface-design",
      "user-research"
    ],
    "caseStudyIds": [
      "improving-marketplace-checkout-experience",
      "effortless-onboarding-with-a-personalised-reward",
      "a-filter-for-every-yogi",
      "custom-lists-for-self-organisation",
      "easy-ordering-for-every-diet"
    ],
    "toolIds": [],
    "achievementIds": [],
    "hasNotes": false,
    "thoughts": "10/10 - The only newsletter I always read immediately ."
  },
  {
    "id": "nudge",
    "title": "Nudge",
    "description": "Currently reading - Coming soon",
    "author": "Richard H. Thaler",
    "publishedYear": 2008,
    "category": "PSYCHOLOGY",
    "status": "IN_PROGRESS",
    "isbn": null,
    "keyTakeaways": [],
    "quotes": [],
    "tags": [],
    "skillIds": ["ux-writing", "user-research", "ux-user-experience-design"],
    "caseStudyIds": [],
    "toolIds": [],
    "achievementIds": [],
    "hasNotes": false,
    "thoughts": "Currently reading - Coming soon"
  },
  {
    "id": "creativity-inc",
    "title": "Creativity Inc.",
    "description": "Overcoming the Unseen Forces That Stand in the Way of True Inspiration",
    "author": "Ed Catmull & Amy Wallace",
    "publishedYear": 2014,
    "category": "LEADERSHIP",
    "status": "COMPLETED",
    "isbn": null,
    "keyTakeaways": [
      "Give a good idea to a mediocre team, and they will screw it up. Give a mediocre idea to a great team, and they will either fix it or come up with something better.",
      "Failure isn't a necessary evil. In fact, it isn't evil at all. It is a necessary consequence of doing something new.",
      "Protect the new."
    ],
    "quotes": [
      "If you don't try to uncover what is unseen and understand its nature, you will be ill prepared to lead.",
      "The cost of preventing errors is often far greater than the cost of fixing them."
    ],
    "tags": ["done", "with notes"],
    "skillIds": ["ux-user-experience-design", "workshop-facilitation"],
    "caseStudyIds": ["oouxing-my-portfolio"],
    "toolIds": [],
    "achievementIds": [],
    "hasNotes": true,
    "thoughts": "9/10 - Inspiring and practical, especially for anyone working in creative teams or leadership."
  }
]
