{
  "projects": [
    {
      "id": "low-stock-communication",
      "title": "Low Stock Communication in the cart",
      "tags": ["Money Maker", "Transparency"],
      "goal": "Communication that an articles stock is under 10 units in the wearhouses, so users are more decisive about their purchase decisions.",
      "process": "This information was included in all article representations throughout the platform. As our article cards can be quite complex, especially for larger items such as washing machines, we decided to not implement the same kind of tag as the rest of the shop (black) but give the information as a red text. The color was not used for anything else yet. In fact, besides the article picture it is the only color that can appear. This made it lighter in visual weight compared to a tag, and left the focus still on important product information while even at a glance giving the sentiment of urgency.",
      "impact": "This was a fairly small change but the impact was impressive! The sold units went up immediately and consistently. It was quite the learning experience to see such a \"minor\" change to have such a big impact.",
      "imagePath": ""
    },
    {
      "id": "minimum-order-value",
      "title": "Minimum Order Value",
      "tags": ["Money Maker", "Transparency"],
      "goal": "Giving incentive to sign up for the shops benefit program (similar to amazon prime) through offering the option to save shipping costs when having reached a minimum order value.",
      "process": "This was quite the endeavour as the project had a short timeline, was technically complex and involved many teams. As the lead UX Designer for the project, I designed and facilitated the workshops. The challenge was not only to communicate current state of a users progress towards the MOV but also to explain its conditions. Not every product on the platform contributes to the value and users have to be signed up to the benefit program.",
      "impact": "Not only did we hold the deadline, overshot the estimated revenue growth and the amount of users signing up for the benefits program, the project itself is still being brought up internally every so often as an example how a good discovery process should look like.",
      "imagePath": ""
    },
    {
      "id": "payment-option-redesign",
      "title": "Payment Option Redesign for Transparency",
      "tags": ["Transparency"],
      "goal": "Being more clear about the conditions of the offered payment options to reduce confusion and prevent cancellations.",
      "process": "This was a small project I initiated based on the hypothesis that users might not understand our payment conditions. I created 3 versions for the new design with added micro copy which were quickly tested in interviews and also quickly implemented afterwards.",
      "impact": "During the user tests we were quite surprised to learn about users misconception about how direct debit works. The new separation between payment options that are for paying now and paying later and the added micro copy was an easy but impactful fix for this. We were also surprised to see an unexpected rise in instalment payments which was a nice bonus.",
      "imagePath": ""
    },
    {
      "id": "opportunity-solution-tree",
      "title": "Method Introduction: Opportunity Solution Tree",
      "tags": ["Internal Improvements"],
      "goal": "As a team we wanted to regain some autonomy about which projects we are working on as, for the past years, that was mostly push by the leadership.",
      "process": "My PO and I introduced the opportunity solution tree to our team during a team day which we started afterwards to use as a structure to figure out and decide what our users need most and what we as a team should focus on. I also started to introduce the method to bigger and bigger rounds within the organisation.",
      "impact": "In our team, the method created a shared understanding about our goal, strategy and rationals. As I started to carry it in other teams as well I got to see more, always slightly different implementations of the method as well as hear about success stories which made me very happy!",
      "imagePath": ""
    },
    {
      "id": "object-oriented-ux",
      "title": "Method Introduction: Object Oriented User Experience",
      "tags": ["Internal Improvements"],
      "goal": "Thinking more holistically about our platform to reduce inconsistencies and move away from thinking in screens.",
      "process": "A design college and I realised that we were both fans of object oriented thinking and started a biweekly meeting to align on the subject and work out ways to introduce more people to the framework. I also started to document all objects I learned about over time to gain a better understanding about our system for myself. After presenting OOUX in a couple of different rounds I started to gain some traction especially with developers and tech writers.",
      "impact": "Once the framework was better understood by more people, I was invited to facilitate several workshops in teams outside my own. This of course led to the spread of framework but also helped me to gain a more complete understanding about our system which I can carry back in my team again.",
      "imagePath": ""
    },
    {
      "id": "insurance-for-installments",
      "title": "Insurance for Installments",
      "tags": ["Money Maker", "Transparency", "Feature Completion"],
      "goal": "The online shop was not always a market place. It took a couple of years of foundational rework to be able to include different sellers on the platform and be able to offer more articles. The insurance for installment payments was a feature that needed to be implemented anew after that technical change.",
      "process": "The biggest challenge was to balance the legal and the business side while making sure that the subject is well understood by the user. For that I focused on writing clear and easy to understand copy to explain how this type of insurance works and what the benefits are.",
      "impact": "We were able to release this feature in a state where we took the users needs into account by purposely avoiding dark patterns. Instead, we clearly explained the value of the product to users, and is became a successful, and profitable feature.",
      "imagePath": ""
    },
    {
      "id": "shorter-article-names",
      "title": "Shorter Article Names",
      "tags": [
        "Money Maker",
        "Transparency",
        "Feature Completion",
        "Internal Improvements"
      ],
      "goal": "Reduce the clutter on our article cards so that users can more easily scan the content of their cart.",
      "process": "The names of articles can get quite long as sellers like to use them as an SEO opportunity. I learned that a different team started to construct \"short names\" to go against that notion and make the article detail pages look more clean. The prototype tests were quick and successful but the biggest issue was to understand how names come into the system as articles can have several types of names that the article detail page was not effected by.",
      "impact": "Though not visible in KPI's the cart was now described with more positive adjectives compared to the old titles.",
      "imagePath": ""
    }
  ]
}
