[
  {
    "id": "ux-user-experience-design",
    "title": "UX | User Experience Design",
    "description": "In 2015 I started out my career as a UX designer. I chose this profession simply because it brings me joy. I love that, as a designer, I can help people with creativity. When I try to explain what UX is (which is not that rare of an occurrence still) I like to use the metaphor of an architect. When building a house, you first need to figure out what rooms should be in it, and then make sure that visitors find a bathroom quickly they need one.",
    "level": "EXPERT",
    "category": "DESIGN",
    "yearsOfExperience": 9,
    "certifications": [],
    "projects": [],
    "customColor": "#53FEA6"
  },
  {
    "id": "user-research",
    "title": "User Research",
    "description": "I always like to work very closely with researchers or take on the role myself. I see it as an  interglacial part as it is the foundation for all decisions throughout the design process. I find it very exciting to learn something new or surprising or seeing that an idea actually worked. It's the feedback loop that keeps product development going. ",
    "level": "EXPERT",
    "category": "RESEARCH",
    "yearsOfExperience": 9,
    "certifications": [],
    "projects": [],
    "customColor": "#FCFE53"
  },
  {
    "id": "prototyping",
    "title": "Prototyping ",
    "description": "Prototyping has been a part of my work since the beginning. This is my zen work. I love to sit down, put on some music and just build. Especially since Figma introduced basic logic to their prototyping capabilities it's been even more fun to be able to make a user test feel as realistic as possible (if needed).",
    "level": "ADVANCED",
    "category": "PROTOTYPING",
    "yearsOfExperience": 9,
    "certifications": [],
    "projects": [],
    "customColor": "#FFB866"
  },
  {
    "id": "ui-user-interface-design",
    "title": "UI | User Interface Design",
    "description": "I've been doing UI alongside UX since 2021. For me UI is not only making things look nice. It's about conveying specific feelings thats suits the task at hand while staying aligned with brand guidelines and design systems. It's about knowing when to be loud and bold to show the brands colors, and when to quite down and guid the users eye to let them focus on important informations. ",
    "level": "ADVANCED",
    "category": "DESIGN",
    "yearsOfExperience": 3,
    "certifications": [],
    "projects": [],
    "customColor": "#FF91D8"
  },
  {
    "id": "ooux-object-oriented-user-experience",
    "title": "OOUX | Object Oriented User Experience",
    "description": "OOUX is a design philosophy that respects the fact, that we think in nouns. That our mental modals form around objects. It helps me to understand users and systems more quickly and easily while also being a grate way of collaborating with other roles in the product team. I really enjoy this way of thinking and would love to work on a project that uses the entire process around!",
    "level": "ADVANCED",
    "category": "STRATEGY",
    "yearsOfExperience": 2,
    "certifications": [],
    "projects": [],
    "customColor": "#90CBFF"
  },
  {
    "id": "drawing-painting",
    "title": "Drawing & Painting",
    "description": "I've been drawing since I can remember. It was always integral to who I am and is one of the first things people learn about me as I like to doodle in meeting (I still pay attention, I swear).",
    "level": "EXPERT",
    "category": "DESIGN",
    "yearsOfExperience": 20,
    "certifications": [],
    "projects": [],
    "customColor": "#DFB7FF"
  },
  {
    "id": "speed-cubing",
    "title": "Speed Cubing",
    "description": "I picked up cubing with a rubiks cube (that thing that was popular in the 80s) when I was around 17 just to see if I can do it. Since then I've not been able to put it down again and my collection has grown to around 20. My best time is 32 sec. which is not super fast but I'm still proud of it. ",
    "level": "INTERMEDIATE",
    "category": "COLLABORATION",
    "yearsOfExperience": 10,
    "certifications": [],
    "projects": [],
    "customColor": "#AFFF64"
  },
  {
    "id": "ux-writing",
    "title": "UX Writing",
    "description": "As someone who is dyslexic I find it important to phrase texts in a clear and easy to understand way, as I know the struggle of overly complicated sentences. This has lead me to put more and more effort and care into the texts I write for interfaces. The impact is easily visible in user tests and always makes me smile.",
    "level": "ADVANCED",
    "category": "DESIGN",
    "yearsOfExperience": 5,
    "certifications": [],
    "projects": [],
    "customColor": "#B9B3FF"
  },
  {
    "id": "workshop-facilitation",
    "title": "Workshop Facilitation",
    "description": "I gathered up quite the suitcase of methods over the years if I do say so myself and appreciate a good flow of them, carefully put together to get to an outcome and output under a shared goal. I'm not the loudest person but passion helps me to get people on board either way.",
    "level": "ADVANCED",
    "category": "COLLABORATION",
    "yearsOfExperience": 7,
    "certifications": [],
    "projects": [],
    "customColor": "#FF8688"
  }
]
